example.json
[

    [

    {"name":"yakshitha", "age":19,"city":"chennai"},
    [1,2,3],
    [3,2,1],
    "Myself",
    35,
    35.5,
    true,
    null
    ]
]

In [4]:
import sqlite3
import json

In [5]:
con = sqlite3.connect("test.db")
print("Database Opened")

Database Opened

In [6]:
cursor = con.cursor()
try:
    cursor.execute("CREATE TABLE MINE"
                   "("
                   + "dictinary BLOB,"
                   + "list BLOB,"
                   + "tuple BLOB,"
                   + "string varchar(50),"
                   + "Integer INTEGER,"
                   + "flo FLOAT,"
                   + "Bool BOOLEAN,"
                   + "None BLOB"
                     ");")
except Exception as e:
    print("Error :", e)
else:
    print("Table created")

Table created

In [ ]:
datafile = open("example.json")
dataset = json.load(datafile)
dataframe = []
for row in dataset:
    data = (str(row[0]), str(row[1]), str(row[2]), str(row[3]), int(row[4]),
            float(row[5]), bool(row[6]), row[7])
    dataframe.append(data)

In [ ]:
try:
    cursor.executemany("INSERT INTO MINE VALUES (?,?,?,?,?,?,?,?)", dataframe)
except Exception as e:
    print("Error : ", e)
else:
    con.commit()
    print("Data inserted")
Data inserted

In [19]:
try:
    cursor.execute("SELECT * from MINE")
except Exception as e:
    print("Error : ", e)
else:
    for row in cursor.fetchall():
        print(row)

Error :  Cannot operate on a closed database.

In [15]:
con.close()